/* Пузенко Артем Андрійович, група ТР-23, варіант № 19
 * Лабораторна робота №2. Оформлення звітів з лабораторних
 * робіт засобами текстового редактора Word */
#include <stdio.h>     /* підмикання бібліотеки stdio.h;
      у програмі використовуються функцiï printf, scanf, getchar, fflush */
#include <stdlib.h>     /* пiдмикання stdlib.h;  у програмі використовуються функції system*/
/* За введеним користувачем числовим кодом від 32 до 255 (кодування ASCII) виводить символ */
int main() {
    int kod;      /* код символа */
 /* символи з кодами 0-31 е службовими; пробіл мае код          32; код 13 вводиться при натисканні на клавішу Enter, 27 - на  Esc */
    printf("vvedit ASCII-kod symvola vid 32 do 255\n");
    scanf_s("%d", &kod);
    if (kod < 32 || kod>255)  printf("nevirnyi kod\n");  
    else printf("symvol %c\n", /* (char) */kod);
    system("pause"); /* затримка екрана */
/* або для затримки екрана випробуйте ще 2 варіанти:
fflush (stdin);  getchar(); - очистка буфера клавіатури (stdin - стандартний потік вводу) і очікування Enter; або
    while (getchar() != '\n'); getchar() ; */
   return 0;
}
