/* Пузенко Артем Андрійович, група ТР-23, варіант №19.
Лабораторна робота № 5.1. Послідовна перевірка умов */
#include <stdio.h> /*Використовуються printf(), scanf()*/ 
#include <math.h> /*Використовується system()*/
#include <stdlib.h> /*Використовуються sin(), sqrt(), fabs()*/
int main(void)
{
	/* Обчислення значення функції, заданої логічною залежністю.
	Використання послідовних умовних операторів */
	double x, // значення аргумента
		y, // значення функції
		a, b; // параметри функції
	int ind; // індикатор друку значення функції
	system("chcp 1251 & cls"); // українізація повідомлень
	/* Виведення вигляду функції на екран */
	printf("     {|ax+7x^3| при x (-inf,9)\n");
	printf("f(x)={5(bx+1)^0.5 при x [9;15)\n");
	printf("     {sin(x) при x = 15\n");
	/* Введення вхідних даних */
	printf("\nВведіть значення a = ");
	scanf_s("%lf", &a);
	printf("Введіть значення b = ");
	scanf_s("%lf", &b);
	printf("Введіть значення x = ");
	scanf_s("%lf", &x);
	ind = 0;
	/* Обчислення значення функції */
	/* Перший проміжок*/
	if (x < 9)
	{
		y = fabs(x * (a + 7 * x * x)); ind = 1;
	}
	/* Другий проміжок. ОДЗ не порушено */
	if ((x >= 9) && (x < 15) && (b * x + 1 >= 0))
	{
		y = 5 * sqrt(b * x + 1); ind = 1;
	}
	/* Другий проміжок. ОДЗ порушено */
	if ((x >= 9) && (x < 15) && (b * x + 1 < 0))
	{
		printf("Підкореневий вираз менше 0\n");
	}
	/* Третій проміжок. Особливостей нема */
	if (x == 15)
	{
		y = sin(x); ind = 1;
	}
	/* Значення х задано поза проміжком */
	if (x > 15)
	{
		printf("Функція не визначена");
	}
	/* Друк результату обчислення */
	if (ind)
		printf("f(%4.2f)=%6.3f", x, y);
	printf("\n\n");
	/* Затримка вікна виведення */
	system("pause");
	return 0;
}
