/* Пузенко Артем Андрійович. Варіант № 19.
Лабораторна робота № 6. Проектування алгоритмів і програм з
вкладеними циклами(цикли з параметром, передумовою і післяумовою) */
#include <stdio.h> 
#include <stdlib.h>
#include <math.h>
#include <string.h>
int main() {
	double x1, x2, h, // границі проміжка і крок
		a, b, x, // параметри a і b і змінна х
		an, s, // степінь числа, сума
		y; // обчислене значення функції
	double eps = 1e-10; // точність обчислень
	char r1[20] = "-------------------", // границя таблиці
		r2[20] = "|   x   |   f(x)   ", // заголовки колонок
		r3[20] = "|       |          "; // порожні клітинки
	long int ind, // чи правильно задано вхідні дані
		i, // номер обчисленого значення
		n, // лічильник циклу при обчисленні суми
		k; // кількість пар колонок
	system("chcp 1251 & cls"); /*Українізація повідомлень*/
	printf("Табулювання функції:\n");
	printf("\tf(x)=(x+1)/(a-sqrt(x+a))*S-4*ln(x+5)\n");
	/* Задання ширини таблиці */
	ind = 1;
	do
	{ // доки не буде правильно задано ширину таблиці
		printf("Вкажіть кількість колонок таблиці (від 1 до 4) -> ");
		scanf_s("%d", &k);
		while (getchar() != '\n'); // очистка буфера
		if (k >= 1 && k <= 4) ind = 0;
		else printf("***Неправильна кількість колонок\n");
	} while (ind);
	/* Введення проміжку */
	ind = 1;
	do
	{ // доки не буде правильно задано проміжок
		printf("Вкажіть проміжок x1, x2 -> ");
		scanf_s("%lf %lf", &x1, &x2);
		while (getchar() != '\n'); // очистка буфера
		if (x1 <= x2) ind = 0;
		else printf("***Помилка: x1 > x2\n");
	} while (ind);
	/* Введення значення параметрів */
		printf("Вкажіть значення параметрів a i b -> ");
		scanf_s("%lf%lf", &a, &b);
		while (getchar() != '\n'); // очистка буфера вводу
	/* Введення кроку */
	ind = 1;
	do { // доки не буде правильно задано крок
		printf("Вкажіть крок h -> ");
		scanf_s("%lf", &h);
		while (getchar() != '\n'); // очистка буфера
		if (h <= x2 - x1 && h > 0) ind = 0;
		else printf("***Помилка: h > x2 - x1 або h <= 0\n");
	} while (ind);
	/* Заголовок таблиці */
	for (i = 1; i <= k; i++)
	{
		printf(r1);
	}
	printf("-\n");
	for (i = 1; i <= k; i++)
	{
		printf(r2);
	}
	printf("|\n");
	for (i = 1; i <= k; i++)
	{
		printf(r1);
	}
	printf("-\n");
	/* Проведення обчислень і заповнення таблиці */
	x = x1; i = 0;
	while (x <= x2 + eps) {
		i++;
		printf("|%6.2f", x);
		if ( x * x - b < 0 || x + 5 < eps || fabs(a - sqrt(x * x - b)) < eps) printf(" | не визн  ");
		else { // функція визначена - обчислення її значення 
			s = 0; an = 16;
			for (n = 3; n <= 5; n++) {
				an *= 4;
				s += (an + x) / (n * n + 1.);
			}
			y = (x + 1) / (a - sqrt(x * x - b)) * s - 4 * log(x + 5);
			if (fabs(y) > 9999.99) { printf(" | переп "); }
			else printf(" | %8.2f ", y);
		}
		if (!(i % k)) { printf("|\n"); }
		x += h;
	}
	/* Доповнення таблиці порожніми клітинками */
	if (i % k) {
		while (i % k) { printf(r3); i++; }
		printf("|\n");
	}
	for (i = 1; i <= k; i++)
	{
		printf(r1);
	}
	printf("-\n");
	return 0;
}
